# Домашнее задание 2 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [ ]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [28]:
import os
import pandas as pd
import numpy as np

In [36]:
df_info = pd.DataFrame()
df_grades = pd.DataFrame()
for item in os.listdir('Data/'):
    if 'info' in item:
        df_info = pd.concat([df_info, pd.read_csv('Data/' + item)])
    else:
        df_grades = pd.concat([df_grades, pd.read_csv('Data/' + item)])
df = pd.merge(df_info, df_grades, on='index')

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [38]:
df.drop('index', inplace=True, axis=1)
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [39]:
df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [40]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [56]:
# Пропущенных значений нет
df.isnull().values.any()

False

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [61]:
df[['math score', 'reading score', 'writing score']].mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [65]:
df.groupby('test preparation course')[['math score', 'reading score', 'writing score']].mean()

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

У студентов проходивших курсы в среднем оценка выше по всем предметам

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [69]:
print(df['lunch'].unique())

['standard' 'free/reduced']

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [74]:
df.rename(columns={'parental level of education': 'education', 'test preparation course': 'test preparation'}, inplace=True)

**Зафиксируем минимальный балл для сдачи экзамена**

In [76]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

Доля студентов, которые сдали экзамен по математике на балл > 50

In [92]:
print(df[df['math score'] >= passmark].shape[0] / df.shape[0] * 100, '%', sep='')

86.5%

Доля студентов, проходивших курс подготовки к экзамену, которые сдали экзамен по математике

In [91]:
print(
    round(
        df[(df['test preparation'] == 'completed') & (df['math score'] >= passmark)].shape[0] / 
        df[df['test preparation'] == 'completed'].shape[0] * 100, 2
    ),
  '%',
  sep=''
)

92.18%

Доля женщин, не проходивших курс подготовки к экзамену, не сдавшие курс по математике

In [104]:
print(
    round(
        df[(df.gender=='female') & (df['test preparation'] == 'none') & (df['math score'] < passmark)].shape[0] 
        / df[(df.gender=='female') & (df['test preparation'] == 'none')].shape[0] * 100,
        2
    ),
    '%',
    sep=''
)

20.96%

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

###### Для каждой этнической группы выведите средний балл за экзамен по чтению

In [114]:
%%time
df.groupby('race/ethnicity')['reading score'].mean()

Wall time: 2 ms

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

###### Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [113]:
%%time
df.groupby('education')['writing score'].min()

Wall time: 2.01 ms

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

###### Для каждой этнической группы выведите средний балл за экзамен по чтению

In [164]:
%%time

data_eth = df[['race/ethnicity', 'reading score']].to_numpy()
num_eth = dict()
sum_eth = dict()

for item in data_eth:
    sum_eth[item[0]] = 0
    num_eth[item[0]] = 0

for item in data_eth:
    sum_eth[item[0]] += item[1]
    num_eth[item[0]] += 1

for key in sum_eth:
    print(key + ':', sum_eth[key] / num_eth[key])

group B: 67.35263157894737
group C: 69.10344827586206
group A: 64.67415730337079
group D: 70.03053435114504
group E: 73.02857142857142
Wall time: 1.99 ms

###### Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [140]:
%%time

data_ed = df[['education', 'writing score']].to_numpy()
min_eth = dict()

for item in data_ed:
    min_eth[item[0]] = 101
    
for item in data_ed:
    if min_eth[item[0]] > item[1]:
        min_eth[item[0]] = item[1]
        
for key in min_eth:
    print(key + ':', min_eth[key])

bachelor's degree: 38
some college: 19
master's degree: 46
associate's degree: 35
high school: 15
some high school: 10
Wall time: 1.99 ms

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

Средняя оценка по математике

In [141]:
df.pivot_table('math score', 'gender', 'education')

education,associate's degree,bachelor's degree,high school,master's degree,some college,some high school
gender,,,,,,
female,65.250000,68.349206,59.351064,66.500000,65.406780,59.296703
male,70.764151,70.581818,64.705882,74.826087,69.009259,67.840909

Средняя оценка по чтению

In [142]:
df.pivot_table('reading score', 'gender', 'education')

education,associate's degree,bachelor's degree,high school,master's degree,some college,some high school
gender,,,,,,
female,74.120690,77.285714,68.202128,76.805556,73.550847,69.109890
male,67.433962,68.090909,61.480392,73.130435,64.990741,64.693182

Средняя оценка по письму

In [143]:
df.pivot_table('writing score', 'gender', 'education')

education,associate's degree,bachelor's degree,high school,master's degree,some college,some high school
gender,,,,,,
female,74.00000,78.380952,66.691489,77.638889,74.050847,68.285714
male,65.40566,67.654545,58.539216,72.608696,63.148148,61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

Для математики

In [161]:
df['Math_PassStatus'] = df['math score'].where(df['math score'] >= 50, other='F')
df['Math_PassStatus'] = df['Math_PassStatus'].where(df['Math_PassStatus'] == 'F', other='P')

In [168]:
df.Math_PassStatus.value_counts()

P    865
F    135
Name: Math_PassStatus, dtype: int64

Для письма

In [165]:
df['Writing_PassStatus'] = df['writing score'].where(df['writing score'] >= 50, other='F')
df['Writing_PassStatus'] = df['Writing_PassStatus'].where(df['Writing_PassStatus'] == 'F', other='P')

In [169]:
df.Writing_PassStatus.value_counts()

P    886
F    114
Name: Writing_PassStatus, dtype: int64

Для чтения

In [170]:
df['Reading_PassStatus'] = df['reading score'].where(df['reading score'] >= 50, other='F')
df['Reading_PassStatus'] = df['Reading_PassStatus'].where(df['Reading_PassStatus'] == 'F', other='P')

In [171]:
df.Reading_PassStatus.value_counts()

P    910
F     90
Name: Reading_PassStatus, dtype: int64

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [184]:
df['OverAll_PassStatus'] = (df[['Math_PassStatus', 'Writing_PassStatus', 'Reading_PassStatus']] == 'P').apply(lambda x: all(x), axis=1)
df['OverAll_PassStatus'] = df['OverAll_PassStatus'].where(df['OverAll_PassStatus'] == True, other='F')
df['OverAll_PassStatus'] = df['OverAll_PassStatus'].where(df['OverAll_PassStatus'] == 'F', other='P')

In [185]:
df.OverAll_PassStatus.value_counts()

P    812
F    188
Name: OverAll_PassStatus, dtype: int64

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [198]:
def GetGrade(average_mark):
    
    grade = 'X'
    
    if average_mark >= 90:
        grade = 'A'
    elif 80 <= average_mark < 90:
        grade = 'B'
    elif 70 <= average_mark < 80:
        grade = 'C'
    elif 60 <= average_mark < 70:
        grade = 'D'
    elif 50 <= average_mark < 60:
        grade = 'E'
    else:
        grade = 'F'
        
    return grade

df['Grade'] = df[['math score', 'reading score', 'writing score']].mean(axis=1).apply(GetGrade)

In [199]:
df.Grade.value_counts()

C    261
D    256
E    182
B    146
F    103
A     52
Name: Grade, dtype: int64